In [4]:
import pandas as pd
# two type of method 
# 1. Series     --> for single dimentional array
# 2. DataFrame  --> for 2 dimentional array

In [ ]:
# use of pandas.
# 1. cleaning data & data processing.
# 2. Exploring the data.
# 3. collection the data.

In [11]:
dic={'name':['naseem','salman','alim'],'city':['mumbai','pune','kolkata'],'Age':[23,34,23]}
print(dic)

{'name': ['naseem', 'salman', 'alim'], 'city': ['mumbai', 'pune', 'kolkata'], 'Age': [23, 34, 23]}

In [12]:
data=pd.DataFrame(dic)   # to convert dictionary object. to dataframe
print(data)

     name     city  Age
0  naseem   mumbai   23
1  salman     pune   34
2    alim  kolkata   23

In [16]:
# how to access a column from dict
# to use of idexing
data['name']   # to retrieve name from dataframe data 
# just like a series output

0    naseem
1    salman
2      alim
Name: name, dtype: object

In [17]:
data['Age']

0    23
1    34
2    23
Name: Age, dtype: int64

In [19]:
data['city']

0     mumbai
1       pune
2    kolkata
Name: city, dtype: object

In [20]:
data.name   # or to use this for retrieving data

0    naseem
1    salman
2      alim
Name: name, dtype: object

In [21]:
# to retrieve multiple columns
# to display nam and city of all students
data

     name     city  Age
0  naseem   mumbai   23
1  salman     pune   34
2    alim  kolkata   23

In [26]:
data[['name','city']]    # to ritrieving multiple student row and column

     name     city
0  naseem   mumbai
1  salman     pune
2    alim  kolkata